tutorials/heatTransfer/chtMultiRegionFoam/externalSolarLoad/0/air/G
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/air";
    object      G;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    maxY
    {
        type            calculated;
        value           uniform 0;
    }
    minX
    {
        type            calculated;
        value           uniform 0;
    }
    maxX
    {
        type            calculated;
        value           uniform 0;
    }
    minY
    {
        type            calculated;
        value           uniform 0;
    }
    maxZ
    {
        type            calculated;
        value           uniform 0;
    }
    air_to_floor
    {
        type            calculated;
        value           uniform 0;
    }
    air_to_solid
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
